jimmywong2003/nrf5-s112-observer-advertiser/ble_app_uart_observer_advertiser/main.c
        memset(&init, 0, sizeof(init));

        init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
        init.advdata.include_appearance = false;
        init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

        init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

        init.config.ble_adv_fast_enabled  = true;
        init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
        init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
        init.evt_handler = on_adv_evt;

        err_code = ble_advertising_init(&m_advertising, &init);
        APP_ERROR_CHECK(err_code);

        ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


#ifdef BLE_SCANNER

/**@brief Function for initializing the beacon scanner module.
 */
static void scanner_init()
{
        m_beacon_scanner_init.evt_handler   = beacon_scan_evt_handler;
        m_beacon_scanner_init.error_handler = beacon_scanner_error_handler;
        app_beacon_scanner_init(&m_beacon_scanner_init);
}

/**@brief Function for starting the beacon scanner module.
 */
static void scanner_start()
{

        NRF_LOG_INFO("Beacon Scanner Start");
        app_beacon_scanner_start();
}

#endif

#ifdef  BLE_ADVERTISER

/**@brief Function for handling a BeaconAdvertiser error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void beacon_advertiser_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing Beacon advertiser.
 */
static void beacon_adv_init(void)
{
        static uint8_t beacon_uuid[] = {BEACON_UUID};

        memcpy(beacon_init.uuid.uuid128, beacon_uuid, sizeof(beacon_uuid));
        beacon_init.adv_interval  = BEACON_ADV_INTERVAL;
        beacon_init.major         = BEACON_MAJOR;
        beacon_init.minor         = BEACON_MINOR;
        beacon_init.manuf_id      = APP_COMPANY_IDENTIFIER;
        beacon_init.rssi          = BEACON_RSSI;
        beacon_init.error_handler = beacon_advertiser_error_handler;

        uint32_t err_code = sd_ble_gap_addr_get(&beacon_init.beacon_addr);
        APP_ERROR_CHECK(err_code);

        beacon_init.beacon_addr.addr[0] += 1;

        app_beacon_init(&beacon_init);
}
#endif

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
        bsp_event_t startup_event;

        uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
        //uint32_t err_code = bsp_init(BSP_INIT_BUTTONS, bsp_event_handler);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(err_code);

        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{

        uint32_t err_code;
        bool erase_bonds;

        // Initialize.
        uart_init();
        log_init();
        timers_init();
        buttons_leds_init(&erase_bonds);
        power_management_init();

        NRF_LOG_INFO("before init");

        ble_stack_init();

        err_code = sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
        APP_ERROR_CHECK(err_code);

        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        printf("\r\nUART started.\r\n");
        NRF_LOG_INFO("Debug logging for UART over RTT started.");

#ifdef  BLE_ADVERTISER
        beacon_adv_init();
#endif
        advertising_start();

#ifdef  BLE_SCANNER
        NRF_LOG_INFO("Start Scanning");
        scanner_init();
        // Start execution.
        scanner_start();
#endif





        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}


/**
 * @}
 */
